src/toir_cf/src/DataProcessors/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_МобильныеПриложения</name>
</mdclass:DataProcessor>

src/toir_cf/src/InformationRegisters/торо_МобильныеПриложения/торо_МобильныеПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_МобильныеПриложения</name>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.mobileMonitor</types>
      <types>ExchangePlanRef.mobileBrigades</types>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеПриложение</name>
    <type>
      <types>EnumRef.торо_МобильноеПриложение</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/DataProcessors/торо_МобильныеПриложения/Forms/ФормаПометитьНаУдалениеНеиспользуемыеУзлы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.МобильноеПриложение.Заголовок = Строка(Параметры.МобильноеПриложение);
	
	ЗаполнитьТаблицу();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УзлыПометкаПриИзменении(Элемент)
	ТекДанные = Элементы.Узлы.ТекущиеДанные;
	Если Не ТекДанные = Неопределено Тогда
		ТекДанные.Картинка = Не ТекДанные.Пометка;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьНаСервере();
	Оповестить("ПометитьНаУдалениеНеиспользуемыеУзлы");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометкиСИспользуемыхУзлов(Команда)
	Для Каждого Узел Из Узлы Цикл
		Если Узел.Используется И Узел.Пометка Тогда
			Узел.Пометка = Ложь;
			Узел.Картинка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеНеиспользуемыеУзлы(Команда)
	Для Каждого Узел Из Узлы Цикл
		Если Не Узел.Используется И Не Узел.Пометка Тогда
			Узел.Пометка = Истина;
			Узел.Картинка = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНеиспользуемыеУзлы(Команда)
	Для Каждого Узел Из Узлы Цикл
		Если Не Узел.Используется И Узел.Пометка Тогда
			Узел.Пометка = Ложь;
			Узел.Картинка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	mobileBrigades.Ссылка КАК Узел,
	               |	mobileBrigades.ИмяУстройства КАК ИмяУстройства,
	               |	mobileBrigades.ПоследнийПользователь КАК ПоследнийПользователь,
	               |	mobileBrigades.ПометкаУдаления КАК Пометка,
	               |	НЕ mobileBrigades.ПометкаУдаления КАК Картинка,
	               |	mobileBrigades.ПометкаУдаления КАК ПрежняяПометка,
	               |	НЕ торо_МобильныеПриложения.Узел ЕСТЬ NULL КАК Используется
	               |ИЗ
	               |	ПланОбмена.mobileBrigades КАК mobileBrigades
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МобильныеПриложения КАК торо_МобильныеПриложения
	               |		ПО (торо_МобильныеПриложения.Узел = mobileBrigades.Ссылка)
	               |ГДЕ
	               |	mobileBrigades.ЭтотУзел = ЛОЖЬ";
	
	Узлы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	НачатьТранзакцию();
	
	Попытка
		Для Каждого Узел Из Узлы Цикл
			Если Не Узел.Пометка = Узел.ПрежняяПометка Тогда
				УзелОбъект = Узел.Узел.ПолучитьОбъект();
				УзелОбъект.ПометкаУдаления = Узел.Пометка;
				УзелОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
